eNum_1_0_1_1/InformationRegisters/ун30_ПравилаНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ун30_ПравилаНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ун30_НастройкиНумерации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

eNum_1_0_1_1/Enums/ун30_НастройкиНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ун30_НастройкиНумерации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФорматДаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодНумерации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмяРеквизита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

eNum_1_0_1_1/InformationRegisters/ун30_ПравилаНумерации/Ext/ManagerModule.bsl
Процедура ЗаписатьНастройки(Настройки) Экспорт
	
	Базовые = Новый Массив;
	Базовые.Добавить("ИмяДокумента");
	Базовые.Добавить("ПредставлениеДокумента");
	Базовые.Добавить("Включить");
	Базовые.Добавить("ВариантНумерации");
	Базовые.Добавить("Разделитель");
	Базовые.Добавить("Перезаписывать");
	Базовые.Добавить("Успех"); // служебное
	
	Для каждого Настройка Из Настройки Цикл
		
		
		Если Базовые.Найти(Настройка.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Менеджер 				= РегистрыСведений.ун30_ПравилаНумерации.СоздатьМенеджерЗаписи();
		Менеджер.ИмяДокумента 	= Настройки.ИмяДокумента;
		Менеджер.Значение 		= Настройка.Значение;
		
		ИмяПД = СтрШаблон("Перечисление.ун30_НастройкиНумерации.%1", Настройка.Ключ);
		Менеджер.Настройка 		= ПредопределенноеЗначение(ИмяПД);
		
		Менеджер.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

Функция ПравилаНумерации(ИмяДокумента) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ун30_ПравилаНумерации.Настройка.Порядок КАК Настройка,
	|	ун30_ПравилаНумерации.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ун30_ПравилаНумерации КАК ун30_ПравилаНумерации
	|ГДЕ
	|	ун30_ПравилаНумерации.ИмяДокумента = &ИмяДокумента";
	Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = Метаданные.Перечисления.ун30_НастройкиНумерации.ЗначенияПеречисления[Выборка.Настройка].Имя;
		Результат.Вставить(Ключ, Выборка.Значение);
	КонецЦикла;
	
	Если НЕ Результат.Свойство("ПериодНумерации") Тогда
		Результат.Вставить("ПериодНумерации", 1);
	КонецЕсли;
	Если НЕ Результат.Свойство("ФорматДаты") Тогда
		Результат.Вставить("ФорматДаты", "01&10~-");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
